Revit 2024 API
UpdaterInfo.IsOptional Property
 Whether the updater is optional or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsOptional { get; }
Visual Basic
Public ReadOnly Property IsOptional As Boolean
	Get
Visual C++
public:
property bool IsOptional {
	bool get ();
}
See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace